Revit 2027 API
RebarFreeFormAccessor.AlignedFreeFormSetOrientationOptions Property
Note: This API is now obsolete.
 Orientation options for an Aligned Free Form Rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2027 and might be removed in a future version. Use FreeFormSetOrientationOptions property instead.")]
public AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions { get; set; }
<ObsoleteAttribute("This property is deprecated in Revit 2027 and might be removed in a future version. Use FreeFormSetOrientationOptions property instead.")>
Public Property AlignedFreeFormSetOrientationOptions As AlignedFreeFormSetOrientationOptions
	Get
	Set
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2027 and might be removed in a future version. Use FreeFormSetOrientationOptions property instead.")]
property AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions {
	AlignedFreeFormSetOrientationOptions get ();
	void set (AlignedFreeFormSetOrientationOptions value);
}
[<ObsoleteAttribute("This property is deprecated in Revit 2027 and might be removed in a future version. Use FreeFormSetOrientationOptions property instead.")>]
member AlignedFreeFormSetOrientationOptions : AlignedFreeFormSetOrientationOptions with get, set
Property Value
AlignedFreeFormSetOrientationOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar is not created with the Aligned Free Form rebar server.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace